; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 9205)
	(= (fuel plane1) 478)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 10)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city3)
	(= (capacity plane2) 11626)
	(= (fuel plane2) 1927)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 11)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 10)
	(at person1 city1)
	(at person2 city5)
	(at person3 city5)
	(at person4 city5)
	(at person5 city5)
	(at person6 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 636)
	(= (distance city0 city2) 554)
	(= (distance city0 city3) 901)
	(= (distance city0 city4) 742)
	(= (distance city0 city5) 611)
	(= (distance city1 city0) 636)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 534)
	(= (distance city1 city3) 796)
	(= (distance city1 city4) 920)
	(= (distance city1 city5) 573)
	(= (distance city2 city0) 554)
	(= (distance city2 city1) 534)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 771)
	(= (distance city2 city4) 569)
	(= (distance city2 city5) 595)
	(= (distance city3 city0) 901)
	(= (distance city3 city1) 796)
	(= (distance city3 city2) 771)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 557)
	(= (distance city3 city5) 709)
	(= (distance city4 city0) 742)
	(= (distance city4 city1) 920)
	(= (distance city4 city2) 569)
	(= (distance city4 city3) 557)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 947)
	(= (distance city5 city0) 611)
	(= (distance city5 city1) 573)
	(= (distance city5 city2) 595)
	(= (distance city5 city3) 709)
	(= (distance city5 city4) 947)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city3)
	(at person1 city4)
	(at person2 city5)
	(at person3 city1)
	(at person4 city5)
	(at person5 city0)
	(at person6 city5)
	))

(:metric minimize (+ (* 4 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane1 city5)
   changed: (fuel plane1) from 478 to 9205
   goals met: 3 of 7
2. (board person3 plane1 city5)
   deleted: (at person3 city5)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 7
3. (board person5 plane1 city5)
   deleted: (at person5 city5)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 7
4. (zoom plane1 city5 city1)
   deleted: (at plane1 city5)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 0 to 5730, (fuel plane1) from 9205 to 3475
   goals met: 3 of 7
5. (debark person3 plane1 city1)
   deleted: (in person3 plane1)
   added: (at person3 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 4 of 7
6. (board person1 plane1 city1)
   deleted: (at person1 city1)
   added: (in person1 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 7
7. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 5730 to 8490, (fuel plane1) from 3475 to 715
   goals met: 4 of 7
8. (debark person1 plane1 city4)
   deleted: (in person1 plane1)
   added: (at person1 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 7
9. (refuel plane1 city4)
   changed: (fuel plane1) from 715 to 9205
   goals met: 5 of 7
10. (fly plane1 city4 city0)
   deleted: (at plane1 city4)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 8490 to 10716, (fuel plane1) from 9205 to 6979
   goals met: 5 of 7
11. (debark person5 plane1 city0)
   deleted: (in person5 plane1)
   added: (at person5 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 7
12. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 10716 to 13419, (fuel plane1) from 6979 to 4276
   goals met: 7 of 7
